# LooseInsertsForCurtainWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LooseDimensionFailures..::..LooseInsertsForCurtainWall Property
BuiltInFailures..::..LooseDimensionFailures Class See Also
---
Switching element type to Curtain element. All inserts in the element will be deleted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LooseInsertsForCurtainWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LooseInsertsForCurtainWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LooseInsertsForCurtainWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LooseDimensionFailures Class
Autodesk.Revit.DB Namespace